#for文
#繰り返し処理をするときに使う

"""-------------------------------------------------------------------------------------------"""
#例(0から99まで数字を表示)
for i in range(100):
    print(i)

#for 繰り返し変数 in range(n):
    #繰り返す処理

#繰り返し変数は特にこだわりがない場合は、iを用いるのが一般的
#for text in textlist:
    #繰り返す処理


"""-------------------------------------------------------------------------------------------"""
#iterable
#繰り返し可能という意味
#例：list, dict, tuple, set, str, range
#iterableなオブジェクトはfor文で回すことができる

integers = [1, 2, 4, 6, 9, 1, 5, 6]
for i in integers:
    print(i)

#pythonでは文字列もiterable
for i in "good morning":
    print(i)

sample_dict = {
    "name" : "sample",
    "age" : "sample",
}
for i in sample_dict:
    print(i)


"""-------------------------------------------------------------------------------------------"""
#iterator


"""-------------------------------------------------------------------------------------------"""
#range:iterableなオブジェクトを作ることができるイテレータ
#range(start, stop, step) start:開始位置(含む), stop:終了位置(含まれない), step:増分、負の値も指定可能
#第一引数と第三引数は省略可能(デフォルトはそれぞれ0と1)
#range(100)はrange(0, 100, 1)と等価